sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
typedef enum State {                // состояния
    ST_FREE,                // ожидает получения команды (значение, устанавливаемое после каждого состояния)
	ST_STOP,                // остановлен
	ST_ACCELERATE,          // разгоняется
	ST_RUN,                 // движется с постоянной скоростью
	ST_DECELERATE           // тормозит
} GD_STATE;

typedef struct RR {
    
    // Время
    // IntervalArray
    // |      NextWriteTo
    // |      |      NextReadFrom
    // |      |      | 
    // v      v      v
    // 0======-------=========
    // 
    //       окончание предыдущей операции ( исходные параметры операции)
    //       |   промежуточное состояние
    //       |   |   Конец операции 
    //       |   |   |
    //       v   v   v 
    // -------========--------
    // 
    
    ARR_TYPE    IntervalArray[BUF_SIZE];    // массив отсчетов времени (кольцевой буффер)
    WORD        NextReadFrom;               // индекс массива времени. указывает на первый значащий элемент
    WORD        NextWriteTo;                // индекс массива времени. указывает на первый свободный элемент
    WORD        DataCount;                  // количество данных в массиве.

    // команды
    GD_CMD      Cmd;
    GD_STATE    State;    
    GD_STATE    NextState;
    
    // исхoдные параметры:
    ARR_TYPE    TimeBeg;  
    DWORD       XaccBeg;                    //параметры функции ускорения (желательно целое число шагов)
    double      Xbeg;
    

    // параметры указывающие на момент окончания
    double      Vend;                       //(надо знать скорость, на которой завершится ускорение)
    double      Xend;
    DWORD       XaccEnd;                    //координата ускорения (DWORD)

    // константы
    double      K;
    double      B;
    double      TimerStep;
    double      dx;

} RR;
RR rr1;
// Use UART2 instead of UART1 for stdout (printf functions).  Explorer 16 
// serial port hardware is on PIC UART2 module.
#if defined(EXPLORER_16) || defined(PIC24FJ256DA210_DEV_BOARD)
    int __C30_UART = 2;
#endif


// Private helper functions.
// These may or may not be present in all applications.
static void InitAppConfig(void);
static void InitializeBoard(void);
static void ProcessIO(void);

int Run(RR * rr);
int Acceleration(RR * rr);
int Deceleration(RR * rr);
ARR_TYPE CalculateT(double X, double K, double B, double TimerStep);
void Calc(void);


#if defined(WF_CS_TRIS)
    static void WF_Connect(void);
#endif

//
// PIC18 Interrupt Service Routines
// 
// NOTE: Several PICs, including the PIC18F4620 revision A3 have a RETFIE FAST/MOVFF bug
// The interruptlow keyword is used to work around the bug when using C18
#if defined(__18CXX)
#if defined(HI_TECH_C)
void interrupt low_priority LowISR(void)
#else
#pragma interruptlow LowISR
void LowISR(void)
#endif
{
    TickUpdate();
}
	
#if defined(HI_TECH_C)
void interrupt HighISR(void)
#else
#pragma interruptlow HighISR
void HighISR(void)
#endif
{
    Nop();	
}

#if !defined(HI_TECH_C)
#pragma code lowVector=0x18
void LowVector(void){_asm goto LowISR _endasm}
#pragma code highVector=0x8
void HighVector(void){_asm goto HighISR _endasm}
#pragma code // Return to default code section
#endif

// C30 and C32 Exception Handlers
// If your code gets here, you either tried to read or write
// a NULL pointer, or your application overflowed the stack
// by having too many local variables or parameters declared.
#elif defined(__C30__)
void _ISR __attribute__((__no_auto_psv__)) _AddressError(void)
{
    Nop();
	Nop();
}
void _ISR __attribute__((__no_auto_psv__)) _StackError(void)
{
    Nop();
    Nop();
}
void __attribute__((__interrupt__,__no_auto_psv__)) _U2RXInterrupt( void )
{
    // используем для вызова вычислений
    IFS1bits.U2RXIF = 0;    
}    
void __attribute__((__interrupt__,__no_auto_psv__)) _T6Interrupt( void )
{	
	static WORD T;
	static WORD T1;
	T  = TMR8;
	T1 = TMR9HLD;
	TMR9HLD = 0x0000;
	TMR8 = 0x0000;
    TMR6 = 0x7FFF;
	CPUSPEED.word.LW = T;
	CPUSPEED.word.HW = T1;
    IFS2bits.T6IF = 0; // Clear T3 interrupt flag
}	
#elif defined(__C32__)
	void _general_exception_handler(unsigned cause, unsigned status)
	{
		Nop();
		Nop();
	}
#endif


//
// Main application entry point.
//
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{
	
	IFS1bits.U2RXIF = 0;
	IPC7bits.U2RXIP = 6;		// Priority level 6
	IEC1bits.U2RXIE = 1;
	IFS1bits.U2RXIF = 1;    
    static DWORD t = 0;
   // static DWORD d = 0;
    static DWORD dwLastIP = 0;
    DWORD_VAL T;
    static WORD TT;

    //volatile DWORD UTCT;
    LATFbits.LATF4 = 0;
    TRISFbits.TRISF4 = 0;	
    
    OC1CONbits.OCM = 0b000;
    OC1CONbits.OCTSEL = 0;  	// выбрать Timer2
    IPC0bits.OC1IP = 0x01;		// выбрать приоритет прерывания для OC1
    IFS0bits.OC1IF = 0;			// сбросить флаг прерывания
    IEC0bits.OC1IE = 1;			// разрешаем прерывания от OC1    
    TmrInit(2);
    
   	{	
	   	T.Val = rr1.IntervalArray[rr1.NextReadFrom]; 	
	   	rr1.NextReadFrom++;
	   	if(rr1.NextReadFrom>=BUF_SIZE) rr1.NextReadFrom-=BUF_SIZE;
	   	OC1CONbits.OCM = 0b000; // выключить модуль OC	   	
	   	OC1R = T.word.LW;		// записать значение OCxR
	   	OC1RS = T.word.LW + 50; // записать значение OCxRS
	   	if(T.word.HW > 0 ){     // если старший байт больше 0, записать его в структуру и выйти
			TT = T.word.HW;
			//return 0;
		}	
	   	OC1CONbits.OCM = 0b100;	// включить модуль OC
   	}
   	while(1){
	   	Nop();
   	}
	Calc();
     
    // Initialize application specific hardware
    // Для работы A13  его нужно отключить от ADC
    {
        TRISAbits.TRISA12 = 1;
        AD1CON1 = 0;
        AD2CON1 = 0;
        AD1PCFGH = 0xFFFF;
        AD1PCFGL = 0xFFFF;
        AD2PCFGL = 0xFFFF;
    }
		
	//BYTE res;
	//char bfr[64];
    //BYTE length=0;
    //AppConfig.MyIPAddr.Val = 0x12345678;
	//while(1){
	//	res = RunClient(bfr, sizeof(bfr), &length);		
	//	res = ProcessClients(0, bfr, &length);			
	//}


    InitializeBoard();
    // calculate CPU speed  
    {
	    T6CON = 0x0002;
	    T8CON = 0x0008;
	    T9CON = 0x0000;
	    PR8=0xFFFF;
	    PR9=0xFFFF;
	    TMR6 = 0x7FFF;
	    TMR8 = 0x0000;
	    TMR9 = 0x0000;	
	    CPUSPEED.Val = 0;
	    IFS2bits.T6IF = 0;
	    IEC2bits.T6IE = 1;
	    IPC11bits.T6IP = 7;
	    T6CONbits.TON = 1;
	    T8CONbits.TON = 1;	
    }
     
