sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
	// Get proper values for the validation structure indicating that we can use 
	// these EEPROM/Flash contents on future boot ups
	NVMValidationStruct.wOriginalChecksum = wOriginalAppConfigChecksum;
	NVMValidationStruct.wCurrentChecksum = CalcIPChecksum((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
	NVMValidationStruct.wConfigurationLength = sizeof(APP_CONFIG);

	// Write the validation struct and current AppConfig contents to EEPROM/Flash
	#if defined(EEPROM_CS_TRIS)
	    XEEBeginWrite(0x0000);
	    XEEWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		XEEWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
    #elif defined(SPIRTCSRAM_CS_TRIS)
        SPISRAMBeginWrite(0x0000);
		SPISRAMWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		SPISRAMWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));        
    #else
		SPIFlashBeginWrite(0x0000);
		SPIFlashWriteArray((BYTE*)&NVMValidationStruct, sizeof(NVMValidationStruct));
		SPIFlashWriteArray((BYTE*)ptrAppConfig, sizeof(APP_CONFIG));
		
    #endif
}
#endif



void Calc(void)
{
    static double dt = 0.0; // изменение времени
    static double V0 = 1.0* Grad_to_Rad;  // мгновенная скорость в радианах
    static double V = 0.0;  // мгновенная скорость в радианах
    static double V1 = 0.0; //мгновенная скорость в радианах
    //static double dX = 1.0/(200.0*16.0);// шаг перемещения в градусах (в 1 градусе 3200 шагов)
    static double dX = PI/(180.0*200.0*16.0); // шаг перемещения в радианах
    static double X = 0;    // полное перемещение в радианах
    static double T = 0;    // полное время
    static double T1 = 0;    // полное время
    
    static double Mass = 500.0f;
    static double Radius = 0.30f;
    static double Length = 2.0f;
    static double Reduction = 360.0f;
    static double I;// = ((Mass*Radius*Radius/4) + (Mass*Length*Length/12))/Reduction;     
    static double K;// = (-0.000349812 * 200 * 180/PI)/I;
    //static double K = (-0.000154286 * 200 * 180/PI)/I;
    //static double B = 0.79962406 / I;
    static double B;// = 0.751428571 / I;
    double XX = 9.0 * Grad_to_Rad;
    double TC;
    double XT;
    
    I = ((Mass*Radius*Radius/4) + (Mass*Length*Length/12))/Reduction; 
    K = (-0.000349812 * 200 * 180/PI)/I;
    B = 0.751428571 / I;
    
    dt = 0.0;
    T = 0.0;
    T1 = 0.0;
    X = 0.0;
    V = 0.0;
    V1 = 0.0;
    rr1.B = B;
    rr1.K = K;
    rr1.dx = dX;
    rr1.TimerStep = 0.0000002;
    rr1.Vend = 0 * Grad_to_Rad;
    V0 = 1.0 * Grad_to_Rad;
    

    // вычислим время в которое пересекутся две функции:
    // x = X0 + V0*T
    // x = B*T*T/(1-K*T)
    // надо еще учесть текущую координату
    TC = (((XX*K/2.0-V0)-sqrtf((V0-K*XX/2.0)*(V0-K*XX/2.0)+ 2.0*XX*(B+V0*K)))/(-2.0*(V0*K+B)));
    
    //double XC = V0 * TC + XX;
    XT = B * TC * TC / (1 - K * TC);
    //double XL = (XC - XT)- XX / 2;
    rr1.Xend = XT; // здесь удвоенная координата. т.к. после ускорения сразу идет торможение
    rr1.DataCount = 0;
    rr1.NextWriteTo = 0;
    rr1.NextReadFrom = 0;    
    rr1.XaccBeg = 0;
    rr1.Xbeg = 0;
    rr1.TimeBeg = 0;//(ARR_TYPE)(1.0 * Grad_to_Rad/((rr1.B + 10.0 * Grad_to_Rad * rr1.K) * rr1.TimerStep));
       
    rr1.State = ST_ACCELERATE;
    rr1.NextState = ST_STOP;
   
    do{		        
         switch(rr1.State){
             case ST_ACCELERATE:
                 Acceleration(&rr1);                  
                 if(rr1.State == ST_RUN){
                     rr1.Vend = 10.0 * Grad_to_Rad;
                     rr1.NextState = ST_DECELERATE;
                 }
                 if(rr1.State == ST_DECELERATE){
                     rr1.Vend = V0;
                     rr1.Xend = 30.0 * Grad_to_Rad;
                     rr1.NextState = ST_RUN;
                 }
                 break;
             case ST_RUN:
                 Run(&rr1);
                 if(rr1.State == ST_DECELERATE){
                     rr1.Vend = 0.004166667 * Grad_to_Rad;
                     rr1.Xend = 20.0 * Grad_to_Rad;
                     rr1.NextState = ST_STOP;
                 }
                 break;
             case ST_DECELERATE:                
                 Deceleration(&rr1); 
                 if(rr1.State == ST_RUN){
                     rr1.Vend = V0;
                     rr1.Xend = 20.0 * Grad_to_Rad;
                     rr1.NextState = ST_STOP;
                 }
                 break;
             case ST_STOP:
                 break;
         }
    }while(rr1.State == ST_STOP);     
}
int Run(RR * rr)
{
    // x = V*T
    // T = X/V;
    WORD i;
    WORD j;
    WORD FreeData = BUF_SIZE - rr->DataCount;  
    double X = 0.0;
    //X = rr->Vend * rr->TimeBeg;
    DWORD Xb = rr->Xbeg/rr->dx;
    DWORD Xe = rr->Xend/rr->dx;
    ARR_TYPE T = 0;
    ARR_TYPE T1 = rr->TimeBeg;// = 0;
    for (i = 0; i < FreeData; i++){
        j = rr->NextWriteTo + i;
        if(j >= BUF_SIZE) j -= BUF_SIZE;  
        X += rr->dx;
        Xb++;
        T = rr->TimeBeg + (ARR_TYPE)(X / (rr->Vend * rr->TimerStep));
        if((Xe != 0) && (Xb >= Xe)){
            FreeData = i;
            rr->State = rr->NextState;                                
            break;
        }
        rr->IntervalArray[j] = T;
        T1 = T;
    }	
    rr->TimeBeg = T1;        
    rr->DataCount += FreeData;
    rr->NextWriteTo += FreeData;
    if(rr->NextWriteTo >= BUF_SIZE) rr->NextWriteTo -= BUF_SIZE;
    rr->Xbeg = Xb * rr->dx;
    return 0;
}
// разгон с текущей скорости до требуемой
//    ARR_TYPE    TimeBeg;  
//    DWORD       XaccBeg;                    //(желательно целое число шагов)

int Acceleration(RR * rr)
{
    WORD j;        
    WORD FreeData = BUF_SIZE - rr->DataCount;
    ARR_TYPE T = 0;
    ARR_TYPE T1 = 0;
    ARR_TYPE dT = 0;
    double X;       // временная переменная 
    ARR_TYPE Tb = 0.0;  
    double D;      
    DWORD Xb = rr->Xbeg/rr->dx;
    DWORD Xe = rr->Xend/rr->dx;
    double K = rr->K;
    double B = rr->B;
    double VKpB = 0.0; 
    double TimerStep;  
    double dx;
    double a;
    double c;
    double d;
    WORD i = 0;
    TimerStep = rr->TimerStep;  
    dx = rr->dx;
    X = rr->XaccBeg * rr->dx; 
    d = K/(2.0 * B * TimerStep);
    c = K*d;
    a = 4.0 * B/(K*K);
    
    if(rr->XaccBeg > 0){
        T1 = CalculateT( X, K, B, rr->TimerStep);         
    }
    Tb = rr->TimeBeg - T1;    
    
