sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
    if(rr->Vend != 0.0){       
        // фактически это реализация формулы (производная X по T):
        //X'(T) = V(T) = B * T *(2 - K * T) / ((1-K * T)*(1-K * T));        
        // VKpB = V*K+B;
        // T = -VKpB+sqrt(B*VKpB)/(K*VKpB); (время из скорости) ЗЫ: VKpB? о_О  ВКпБ?        
        VKpB = rr->Vend * K + B;
        D = B * VKpB;
        dT = (-VKpB + sqrtf(D))/(-K * VKpB * TimerStep);
    }
    // оптимизировано 35 uSec (1431.5 тактов за шаг)
    for( i = 0; i < FreeData; i++) {        
        j = rr->NextWriteTo + i;
        if(j >= BUF_SIZE) j -= BUF_SIZE;
        X += dx;    
        Xb++;        
        D = X *(X + a);
        if(D >= 0.0){
            T = (ARR_TYPE)((-X - sqrtf(D))*d);    
        }               
        if(((dT != 0)&&(T >= dT))||((Xe != 0)&&(Xb >= Xe))){
            FreeData = i;
            rr->State = rr->NextState;                                
            break;
        }
        rr->IntervalArray[j] = Tb + T;  
        T1 = T;
    }
    rr->TimeBeg = Tb + T1;
    rr->XaccBeg += FreeData; 
    rr->DataCount += FreeData;
    rr->NextWriteTo += FreeData;
    if(rr->NextWriteTo >= BUF_SIZE) rr->NextWriteTo -= BUF_SIZE;
    rr->Xbeg = Xb * rr->dx;
    return 0;
}

ARR_TYPE CalculateT(double X, double K, double B, double TimerStep)
{
    double D;	
    double Kx;

    Kx = X * K;
    D = Kx * Kx + 4.0 * X * B;
    if(D >= 0.0){
        return (ARR_TYPE)((-Kx + sqrtf(D))/(2.0 * TimerStep * B ));    
    }
    return (ARR_TYPE) 0;
}

// торможение с текущей скорости до требуемой
int Deceleration(RR * rr)
{    
    WORD j;        
    WORD FreeData = BUF_SIZE - rr->DataCount;
    ARR_TYPE T = 0;
    ARR_TYPE T1 = 0;
    ARR_TYPE dT = 0;
    double X;       // временныя переменная 
    ARR_TYPE Tb = 0.0; 
    double K = rr->K;
    double B = rr->B;
    double VKpB = 0.0; 
    DWORD Xb = rr->Xbeg/rr->dx;
    DWORD Xe = rr->Xend/rr->dx;
    double TimerStep = rr->TimerStep;
    WORD i;

    X = rr->XaccBeg * rr->dx; 
    if(rr->XaccBeg > 0){
        T1 = CalculateT( X, K, B, TimerStep);         
    }
    Tb = rr->TimeBeg + T1;    

    if(rr->Vend != 0.0){        
        VKpB = rr->Vend * K + B;
        dT = (-VKpB + sqrt(B * VKpB))/(-K * VKpB * TimerStep);
    }

    for(i = 0; i < FreeData; i++) {        
        j = rr->NextWriteTo + i;
        if(j >= BUF_SIZE) j -= BUF_SIZE;
        X -= rr->dx;  
        if(X<=0.0){
            FreeData = i;
            rr->State = rr->NextState;            
            break;
        }
        Xb++;
        T = CalculateT( X, K, B, TimerStep);           
        if(((dT!=0)&&( T <= dT))||((Xe != 0)&&(Xb >= Xe))){
            FreeData = i;
            rr->State = rr->NextState;                                
            break;
        }
        rr->IntervalArray[j] = Tb - T;  
        T1 = T;

    }
    rr->TimeBeg = Tb - T1;
    rr->XaccBeg -= FreeData; 
    rr->DataCount += FreeData;
    rr->NextWriteTo += FreeData;
    if(rr->NextWriteTo >= BUF_SIZE) rr->NextWriteTo -= BUF_SIZE;
    rr->Xbeg = Xb * rr->dx;
    return 0;
}
